kOmegaSSTLM-TransitionModel/PlasmaRegionOn/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

MomentumSource
{
    type            vectorSemiImplicitSource;
    active          true;
    selectionMode   cellSet;
    cellSet         plasmaCellSet;
    fields	    (U);
    volumeMode      specific;

    sources
    {
        U
        {
            explicit table
(
(0.00000000 (0.000000 0 0))
(0.00001562 (11.602982 0 0))
(0.00003125 (44.645480 0 0))
(0.00004688 (94.097073 0 0))
(0.00006250 (152.429205 0 0))
(0.00007812 (210.761336 0 0))
(0.00009375 (260.212929 0 0))
(0.00010938 (293.255427 0 0))
(0.00012500 (304.858409 0 0))
(0.00014063 (293.255427 0 0))
(0.00015625 (260.212929 0 0))
(0.00017188 (210.761336 0 0))
(0.00018750 (152.429205 0 0))
(0.00020312 (94.097073 0 0))
(0.00021875 (44.645480 0 0))
(0.00023438 (11.602982 0 0))
(0.00025000 (0.000000 0 0))
(0.00026563 (11.602982 0 0))
(0.00028125 (44.645480 0 0))
(0.00029688 (94.097073 0 0))
(0.00031250 (152.429205 0 0))
(0.00032812 (210.761336 0 0))
(0.00034375 (260.212929 0 0))
(0.00035938 (293.255427 0 0))
(0.00037500 (304.858409 0 0))
(0.00039062 (293.255427 0 0))
(0.00040625 (260.212929 0 0))
(0.00042188 (210.761336 0 0))
(0.00043750 (152.429205 0 0))
(0.00045312 (94.097073 0 0))
(0.00046875 (44.645480 0 0))
(0.00048438 (11.602982 0 0))
(0.00050000 (0.000000 0 0))
(0.00051562 (11.602982 0 0))
(0.00053125 (44.645480 0 0))
(0.00054688 (94.097073 0 0))
(0.00056250 (152.429205 0 0))
(0.00057812 (210.761336 0 0))
(0.00059375 (260.212929 0 0))
(0.00060938 (293.255427 0 0))
(0.00062500 (304.858409 0 0))
(0.00064062 (293.255427 0 0))
(0.00065625 (260.212929 0 0))
(0.00067188 (210.761336 0 0))
(0.00068750 (152.429205 0 0))
(0.00070312 (94.097073 0 0))
(0.00071875 (44.645480 0 0))
(0.00073438 (11.602982 0 0))
(0.00075000 (0.000000 0 0))
(0.00076562 (11.602982 0 0))
(0.00078125 (44.645480 0 0))
(0.00079688 (94.097073 0 0))
(0.00081250 (152.429205 0 0))
(0.00082812 (210.761336 0 0))
(0.00084375 (260.212929 0 0))
(0.00085938 (293.255427 0 0))
(0.00087500 (304.858409 0 0))
(0.00089062 (293.255427 0 0))
(0.00090625 (260.212929 0 0))
(0.00092188 (210.761336 0 0))
(0.00093750 (152.429205 0 0))
(0.00095312 (94.097073 0 0))
(0.00096875 (44.645480 0 0))
(0.00098438 (11.602982 0 0))
(0.00100000 (0.000000 0 0))
(0.00101562 (11.602982 0 0))
(0.00103125 (44.645480 0 0))
(0.00104688 (94.097073 0 0))
(0.00106250 (152.429205 0 0))
(0.00107813 (210.761336 0 0))
(0.00109375 (260.212929 0 0))
(0.00110938 (293.255427 0 0))
(0.00112500 (304.858409 0 0))
(0.00114062 (293.255427 0 0))
(0.00115625 (260.212929 0 0))
(0.00117188 (210.761336 0 0))
(0.00118750 (152.429205 0 0))
(0.00120312 (94.097073 0 0))
(0.00121875 (44.645480 0 0))
(0.00123438 (11.602982 0 0))
(0.00125000 (0.000000 0 0))
(0.00126562 (11.602982 0 0))
(0.00128125 (44.645480 0 0))
(0.00129688 (94.097073 0 0))
(0.00131250 (152.429205 0 0))
(0.00132812 (210.761336 0 0))
(0.00134375 (260.212929 0 0))
(0.00135938 (293.255427 0 0))
(0.00137500 (304.858409 0 0))
(0.00139062 (293.255427 0 0))
(0.00140625 (260.212929 0 0))
(0.00142188 (210.761336 0 0))
(0.00143750 (152.429205 0 0))
(0.00145312 (94.097073 0 0))
(0.00146875 (44.645480 0 0))
(0.00148438 (11.602982 0 0))
(0.00150000 (0.000000 0 0))
(0.00151562 (11.602982 0 0))
(0.00153125 (44.645480 0 0))
...
);

            implicit 0;  // optional, can omit or set to 0s
        }
    }
}

// ************************************************************************* //