kOmegaSSTLM-TransitionModel/PlasmaRegionOn/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-0.25   0.02  -0.25)  // Bottom-left-front corner
    ( 0.75   0.02  -0.25)  // Bottom-right-front corner
    ( 0.75   0.02   0.25)  // Top-right-front corner
    (-0.25   0.02   0.25)  // Top-left-front corner
    (-0.25  -0.02  -0.25)  // Bottom-left-back corner
    ( 0.75  -0.02  -0.25)  // Bottom-right-back corner
    ( 0.75  -0.02   0.25)  // Top-right-back corner
    (-0.25  -0.02   0.25)  // Top-left-back corner
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 20 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    topAndBottom
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    port
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
    starBoard
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);




// ************************************************************************* //
