kOmegaSSTLM-TransitionModel/PlasmaRegionOn/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         backward;
}

gradSchemes
{
    default         cellMDLimited Gauss linear 0.5; 
    grad(U)         cellMDLimited Gauss linear 0.5;
    grad(p)         cellMDLimited Gauss linear 0.5;
}

divSchemes
{
    default         Gauss linearUpwind default;

    div(phi,U)      Gauss linearUpwind grad(U);

    turbulence      bounded Gauss upwind;
    div(phi,k)      Gauss linearUpwind default;
    div(phi,omega)  Gauss linearUpwind default;

    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited 1.0;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited 1.0;
}

wallDist
{
    method          meshWave;
}


// ************************************************************************* //
